fixed the issues related to lp
